In [1]:
import pandas as pd

### DataFrame from Dictionary

In [2]:
stud={}
stud["Roll_no"]=[1,2,3,4,5]
stud["Name"]=["alex","jae","max","joe","rose"]
stud["division"]=["A","B","A","B","A"]
stud["marks"]=[15,16,10,11,17]
stud

{'Roll_no': [1, 2, 3, 4, 5],
 'Name': ['alex', 'jae', 'max', 'joe', 'rose'],
 'division': ['A', 'B', 'A', 'B', 'A'],
 'marks': [15, 16, 10, 11, 17]}

In [3]:
df=pd.DataFrame(stud)
df

   Roll_no  Name division  marks
0        1  alex        A     15
1        2   jae        B     16
2        3   max        A     10
3        4   joe        B     11
4        5  rose        A     17

### DataFrame from empty DF

In [4]:
df=pd.DataFrame()

In [5]:
#dataframe["new col name"]= list or array or series of values
df=pd.DataFrame()
df["Roll_no"]=[1,2,3,4,5]
df["Name"]=["alex","jae","max","joe","rose"]
df["division"]=["A","B","A","B","A"]
df["marks"]=[15,16,10,11,17]
df

   Roll_no  Name division  marks
0        1  alex        A     15
1        2   jae        B     16
2        3   max        A     10
3        4   joe        B     11
4        5  rose        A     17

### Access the Dataframe

In [6]:
#df[column name]
df["Name"]

0    alex
1     jae
2     max
3     joe
4    rose
Name: Name, dtype: object

In [7]:
#df[[col1 , col2]]
df[["Name","division"]]

   Name division
0  alex        A
1   jae        B
2   max        A
3   joe        B
4  rose        A

In [8]:
df.Name

0    alex
1     jae
2     max
3     joe
4    rose
Name: Name, dtype: object

### DataFrame Properties

In [9]:
df.columns

Index(['Roll_no', 'Name', 'division', 'marks'], dtype='object')

In [10]:
df.shape

(5, 4)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Roll_no   5 non-null      int64
 1   Name      5 non-null      object
 2   division  5 non-null      object
 3   marks     5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes

In [12]:
df.describe()

        Roll_no      marks
count  5.000000   5.000000
mean   3.000000  13.800000
std    1.581139   3.114482
min    1.000000  10.000000
25%    2.000000  11.000000
50%    3.000000  15.000000
75%    4.000000  16.000000
max    5.000000  17.000000

### Indexing (iloc & loc)

### iloc

In [13]:
#access first row
df.iloc[0]

Roll_no        1
Name        alex
division       A
marks         15
Name: 0, dtype: object

In [14]:
#access name of first row
df.iloc[0,1]

'alex'

In [15]:
#accessing data by passing list of index
df.iloc[[0,1],[0,1,2,3]]

   Roll_no  Name division  marks
0        1  alex        A     15
1        2   jae        B     16

In [16]:
#accessing data using slicing
df

   Roll_no  Name division  marks
0        1  alex        A     15
1        2   jae        B     16
2        3   max        A     10
3        4   joe        B     11
4        5  rose        A     17

### loc

In [17]:
# access first row
df.loc[0]

Roll_no        1
Name        alex
division       A
marks         15
Name: 0, dtype: object

In [18]:
#access first rows name and div
df.loc[0,["Name","division"]]

Name        alex
division       A
Name: 0, dtype: object

In [19]:
#name and div of first 3 records using slicing in row
df.loc[0:2,["Name","division"]]

   Name division
0  alex        A
1   jae        B
2   max        A

In [20]:
#name and div of first 3 records using list of index in row 
df.loc[[0,1,2],["Name","division"]]

   Name division
0  alex        A
1   jae        B
2   max        A

### CSV

#### Dataframe to csv

In [21]:
df.to_csv("data.csv",index=False)

#### Csv to Dataframe

In [22]:
df=pd.read_csv("data.csv")

In [23]:
df

   Roll_no  Name division  marks
0        1  alex        A     15
1        2   jae        B     16
2        3   max        A     10
3        4   joe        B     11
4        5  rose        A     17